---
kind: other
id: Methods.T:Autodesk.Revit.DB.CylindricalFace
source: html/77c23cdd-66f1-4c5a-de2c-4ad97e29838a.htm
---
# CylindricalFace Methods

Returns the first partial derivatives of the underlying surface at the specified point.